#Область ОписаниеПеременных 

	&НаКлиенте
	Перем СреднееКоличествоЗанятийВМесяц;
	
#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЦены

&НаКлиенте
Процедура ЦеныЦенаЗаЗанятиеПриИзменении(Элемент)
	
	СреднееКоличествоЗанятийВМесяц = 8;
	
	ТекущаяСтрока = Элементы.Цены.ТекущиеДанные;
	
	ТекущаяСтрока.ЦенаЗаМесяц = ТекущаяСтрока.ЦенаЗаЗанятие * СреднееКоличествоЗанятийВМесяц; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти 
