#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

 Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ 
	
	// регистр ЦеныОбучения
	Движения.ЦеныОбучения.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаЦенЦены.ВозраснаяГруппа КАК ВозраснаяГруппа,
		|	УстановкаЦенЦены.ФормаЗанятий КАК ФормаЗанятий,
		|	МАКСИМУМ(УстановкаЦенЦены.ЦенаЗаЗанятие) КАК ЦенаЗаЗанятие,
		|	КОЛИЧЕСТВО(УстановкаЦенЦены.ЦенаЗаЗанятие) КАК ЦенаЗаЗанятиеКоличество,
		|	УстановкаЦенЦены.ВозраснаяГруппа.Представление КАК ВозраснаяГруппаПредставление
		|ИЗ
		|	Документ.УстановкаЦен.Цены КАК УстановкаЦенЦены
		|ГДЕ
		|	УстановкаЦенЦены.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаЦенЦены.ВозраснаяГруппа,
		|	УстановкаЦенЦены.ФормаЗанятий";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ПоляТаблицыЦеныСДублями = "Есть дубли: ";
	
	Пока Выборка.Следующий() Цикл
		
		// Проверка на дубли в ТЧ Цены
		Если Выборка.ЦенаЗаЗанятиеКоличество > 1 Тогда
			
			Отказ = Истина;
			
			ПоляТаблицыЦеныСДублями = ПоляТаблицыЦеныСДублями + Выборка.ВозраснаяГруппаПредставление + " и " + Выборка.ФормаЗанятий + ", "
						
		КонецЕсли;
		
		// регистр ЦеныОбучения
		Движение = Движения.ЦеныОбучения.Добавить();
		Движение.Период = Дата;
		Движение.ВозрастнаяГруппа = Выборка.ВозраснаяГруппа;
		Движение.ФормаЗанятий = Выборка.ФормаЗанятий;
		Движение.УчебныйГод = УчебныйГод;
		Движение.ЦенаЗаЗанятие = Выборка.ЦенаЗаЗанятие;
		
	КонецЦикла;
	
	Если Отказ Тогда
		ОбщегоНазначения.СообщитьПользователю(ПоляТаблицыЦеныСДублями);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

